export const worksBox: worksBoxInterface[] = [
  {
    img: 'react-pizza',
    title: 'React-pizza v2.0',
    difficulty: 'высокая',
    tags: [
      'html',
      'css',
      'scss',
      'typescript',
      'react',
      'rtk',
      'интернет-магазин',
      'корзина',
    ],
    about:
      'первая работа с использованием react.js. Подключено сохранение товаров в локальное хранилище, корзина работает. Из недостатков: нет оплаты, а так готовый магазин :)',
    link: 'https://maximbri.github.io/React-pizza/',
    quality: 8,
  },
  {
    img: 'kokos',
    title: 'KOKOC',
    difficulty: 'высокая',
    tags: ['css', 'javascript', 'react', 'rtk', 'сайт для футбольного клуба'],
    about:
      'разрабатывался командой в рамках хакатона. Успели связать фронт с бэком, реализовать достаточно объёмный функционал: личный кабинет, магазин, ленту новостей. За это собственно и получили призовое 3 место. Если разбогатею, может куплю сервер, выложу этот проект туда, а пока довольствуйтесь картинками 🙃',
    link: 'https://kwork.ru/portfolio/14490491',
    quality: 8,
  },
  {
    img: 'inProcess',
    title: 'Коты и пирожки (???)',
    difficulty: 'высокая',
    tags: [
      'html',
      'css',
      'scss',
      'typescript',
      'react',
      'rtk',
      'личный кабинет',
      'создать кота',
    ],
    about:
      'масштабный, но несмотря на это, постепенно пилится, работаем немногочисленной командой. Я думаю когда-нибудь мы точно закончим его) Предполагаемый основной функционал: личный кабинет, магазин пирожков, банк для переводов монеток',
    link: 'https://maximbri.github.io/React-project/',
    quality: 8,
  },
  {
    img: 'inProcess',
    title: 'Рандомайзер',
    difficulty: 'высокая',
    tags: ['html', 'css', 'typescript', 'рандомайзер'],
    about:
      'по идее должен будет выполнять функции как обычного рандомайзера, так и рандомайзера еды (ох уж эта проблема: что приготовить?). Это основной функционал, но подразумевается достаточно много доп. функционала, но о его реализации говорить пока рано. Проект находится в очереди, но он уже был когда-то начат и я надеюсь, что когда-нибудь он увидит этот мир)',
    link: '#',
    quality: 7,
  },
  {
    img: 'Dexter',
    title: 'Dexter',
    difficulty: 'низкая',
    tags: ['html', 'tailwind', 'javascript', 'react', 'typescript', 'лендинг'],
    about:
      'лендинг под заказ. Не спрашивайте меня, почему лендинг на таком стеке, это требования заказчика)',
    link: 'https://maximbri.github.io/Exploit/',
    quality: 6,
  },
  {
    img: 'notions',
    title: 'Заметки',
    difficulty: 'низкая',
    tags: ['html', 'css', 'javascript', 'notion'],
    about:
      'главная суть заключается в том, что вся логика сие чуда написана на чистом js без вот этих ваших react/vue/angular и прочих. Клепался под НГ за коротки сроки, не судите строго) Реализовано сохранение всех заметок в хранилище, а потому вы не потеряете свои данные при обновлении страницы (только не чистите кэш). Что касается расширения функционала: возможно я сделаю продвинутую версию данного чуда, но уже на react и не в ближайшее время точно)',
    link: 'https://maximbri.github.io/MyNotions/',
    quality: 6,
  },
  {
    img: 'SaleApartment',
    title: 'Аренда квартир',
    difficulty: 'средняя',
    tags: ['html', 'css', 'scss', 'javascript', 'многостраничник'],
    about:
      'первая работа по реальному макету. Включает в себя 3 страницы, "сыроватая" работа',
    link: 'https://maximbri.github.io/Rent-Apartments-59/',
    quality: 4,
  },
  {
    img: 'DyDx',
    title: 'DyDx',
    difficulty: 'средняя',
    tags: ['html', 'css', 'scss', 'javascript', 'многонстраничик'],
    about:
      'что-то около 13 страниц. Чисто вёрстка, с большими перспективами, если связать с бэком. Приходится довольствоваться только картинками, потому что я сильно накосячил в кроссбраузерности. Пока переделывать лень',
    link: 'https://kwork.ru/portfolio/13658592',
    quality: 4,
  },
  {
    img: 'positivus',
    title: 'Positivus',
    difficulty: 'низкая',
    tags: ['html', 'css', 'javascript', 'лендинг'],
    about:
      'одна из первых работ. Есть бургер-меню, плавное появление элементов во время скролла',
    link: 'https://maximbri.github.io/Positivus/',
    quality: 3,
  },

  {
    img: 'stayHealthy',
    title: 'Stay Healthy',
    difficulty: 'низкая',
    tags: ['html', 'css', 'javascript', 'лендинг'],
    about: 'одна из первых работ. Приятная внешне, на этом пожалуй всё)',
    link: 'https://kwork.ru/portfolio/13325900',
    quality: 3,
  },
  {
    img: 'Takeaway&delivery',
    title: 'Takeaway&delivery',
    difficulty: 'низкая',
    tags: ['html', 'css', 'scss', 'javascript', 'лендинг'],
    about:
      'приятная работа, особо ничем не выделяется) Довольствуемся лишь картинками, имхо барахлит бургер-меню. Исправлять пока лень, но как починю, вы это сможете увидеть 😉',
    link: 'https://kwork.ru/portfolio/13335257',
    quality: 2,
  },
  {
    img: 'createx',
    title: 'СreateX',
    difficulty: 'низкая',
    tags: ['html', 'css', 'javascript', 'лендинг'],
    about:
      'первая работа. Косячная, без адаптива, а потому довольствуйтесь картинками 😬',
    link: 'https://kwork.ru/portfolio/13326098',
    quality: 1,
  },
]

export const worksBoxLength = worksBox.length
